SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_lesense.h
/* Bit fields for LESENSE PERCTRL */
#define _LESENSE_PERCTRL_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_PERCTRL           */
#define _LESENSE_PERCTRL_MASK                   0x03500144UL                            /**< Mask for LESENSE_PERCTRL                    */
#define LESENSE_PERCTRL_DACCH0DATA              (0x1UL << 2)                            /**< DAC CH0 data selection.                     */
#define _LESENSE_PERCTRL_DACCH0DATA_SHIFT       2                                       /**< Shift value for LESENSE_DACCH0DATA          */
#define _LESENSE_PERCTRL_DACCH0DATA_MASK        0x4UL                                   /**< Bit mask for LESENSE_DACCH0DATA             */
#define _LESENSE_PERCTRL_DACCH0DATA_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_DACCH0DATA_DACDATA     0x00000000UL                            /**< Mode DACDATA for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_DACCH0DATA_THRES       0x00000001UL                            /**< Mode THRES for LESENSE_PERCTRL              */
#define LESENSE_PERCTRL_DACCH0DATA_DEFAULT      (_LESENSE_PERCTRL_DACCH0DATA_DEFAULT << 2) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_DACCH0DATA_DACDATA      (_LESENSE_PERCTRL_DACCH0DATA_DACDATA << 2) /**< Shifted mode DACDATA for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_DACCH0DATA_THRES        (_LESENSE_PERCTRL_DACCH0DATA_THRES << 2) /**< Shifted mode THRES for LESENSE_PERCTRL      */
#define LESENSE_PERCTRL_DACSTARTUP              (0x1UL << 6)                            /**< DAC startup configuration                   */
#define _LESENSE_PERCTRL_DACSTARTUP_SHIFT       6                                       /**< Shift value for LESENSE_DACSTARTUP          */
#define _LESENSE_PERCTRL_DACSTARTUP_MASK        0x40UL                                  /**< Bit mask for LESENSE_DACSTARTUP             */
#define _LESENSE_PERCTRL_DACSTARTUP_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_DACSTARTUP_FULLCYCLE   0x00000000UL                            /**< Mode FULLCYCLE for LESENSE_PERCTRL          */
#define _LESENSE_PERCTRL_DACSTARTUP_HALFCYCLE   0x00000001UL                            /**< Mode HALFCYCLE for LESENSE_PERCTRL          */
#define LESENSE_PERCTRL_DACSTARTUP_DEFAULT      (_LESENSE_PERCTRL_DACSTARTUP_DEFAULT << 6) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_DACSTARTUP_FULLCYCLE    (_LESENSE_PERCTRL_DACSTARTUP_FULLCYCLE << 6) /**< Shifted mode FULLCYCLE for LESENSE_PERCTRL  */
#define LESENSE_PERCTRL_DACSTARTUP_HALFCYCLE    (_LESENSE_PERCTRL_DACSTARTUP_HALFCYCLE << 6) /**< Shifted mode HALFCYCLE for LESENSE_PERCTRL  */
#define LESENSE_PERCTRL_DACCONVTRIG             (0x1UL << 8)                            /**< DAC conversion trigger configuration        */
#define _LESENSE_PERCTRL_DACCONVTRIG_SHIFT      8                                       /**< Shift value for LESENSE_DACCONVTRIG         */
#define _LESENSE_PERCTRL_DACCONVTRIG_MASK       0x100UL                                 /**< Bit mask for LESENSE_DACCONVTRIG            */
#define _LESENSE_PERCTRL_DACCONVTRIG_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_DACCONVTRIG_CHANNELSTART 0x00000000UL                            /**< Mode CHANNELSTART for LESENSE_PERCTRL       */
#define _LESENSE_PERCTRL_DACCONVTRIG_SCANSTART  0x00000001UL                            /**< Mode SCANSTART for LESENSE_PERCTRL          */
#define LESENSE_PERCTRL_DACCONVTRIG_DEFAULT     (_LESENSE_PERCTRL_DACCONVTRIG_DEFAULT << 8) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_DACCONVTRIG_CHANNELSTART (_LESENSE_PERCTRL_DACCONVTRIG_CHANNELSTART << 8) /**< Shifted mode CHANNELSTART for LESENSE_PERCTRL*/
#define LESENSE_PERCTRL_DACCONVTRIG_SCANSTART   (_LESENSE_PERCTRL_DACCONVTRIG_SCANSTART << 8) /**< Shifted mode SCANSTART for LESENSE_PERCTRL  */
#define LESENSE_PERCTRL_ACMP0MODE               (0x1UL << 20)                           /**< ACMP0 mode                                  */
#define _LESENSE_PERCTRL_ACMP0MODE_SHIFT        20                                      /**< Shift value for LESENSE_ACMP0MODE           */
#define _LESENSE_PERCTRL_ACMP0MODE_MASK         0x100000UL                              /**< Bit mask for LESENSE_ACMP0MODE              */
#define _LESENSE_PERCTRL_ACMP0MODE_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_ACMP0MODE_MUX          0x00000000UL                            /**< Mode MUX for LESENSE_PERCTRL                */
#define _LESENSE_PERCTRL_ACMP0MODE_MUXTHRES     0x00000001UL                            /**< Mode MUXTHRES for LESENSE_PERCTRL           */
#define LESENSE_PERCTRL_ACMP0MODE_DEFAULT       (_LESENSE_PERCTRL_ACMP0MODE_DEFAULT << 20) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_ACMP0MODE_MUX           (_LESENSE_PERCTRL_ACMP0MODE_MUX << 20)  /**< Shifted mode MUX for LESENSE_PERCTRL        */
#define LESENSE_PERCTRL_ACMP0MODE_MUXTHRES      (_LESENSE_PERCTRL_ACMP0MODE_MUXTHRES << 20) /**< Shifted mode MUXTHRES for LESENSE_PERCTRL   */
#define LESENSE_PERCTRL_ACMP1MODE               (0x1UL << 22)                           /**< ACMP1 mode                                  */
#define _LESENSE_PERCTRL_ACMP1MODE_SHIFT        22                                      /**< Shift value for LESENSE_ACMP1MODE           */
#define _LESENSE_PERCTRL_ACMP1MODE_MASK         0x400000UL                              /**< Bit mask for LESENSE_ACMP1MODE              */
#define _LESENSE_PERCTRL_ACMP1MODE_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define _LESENSE_PERCTRL_ACMP1MODE_MUX          0x00000000UL                            /**< Mode MUX for LESENSE_PERCTRL                */
#define _LESENSE_PERCTRL_ACMP1MODE_MUXTHRES     0x00000001UL                            /**< Mode MUXTHRES for LESENSE_PERCTRL           */
#define LESENSE_PERCTRL_ACMP1MODE_DEFAULT       (_LESENSE_PERCTRL_ACMP1MODE_DEFAULT << 22) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_ACMP1MODE_MUX           (_LESENSE_PERCTRL_ACMP1MODE_MUX << 22)  /**< Shifted mode MUX for LESENSE_PERCTRL        */
#define LESENSE_PERCTRL_ACMP1MODE_MUXTHRES      (_LESENSE_PERCTRL_ACMP1MODE_MUXTHRES << 22) /**< Shifted mode MUXTHRES for LESENSE_PERCTRL   */
#define LESENSE_PERCTRL_ACMP0INV                (0x1UL << 24)                           /**< Invert analog comparator 0 output           */
#define _LESENSE_PERCTRL_ACMP0INV_SHIFT         24                                      /**< Shift value for LESENSE_ACMP0INV            */
#define _LESENSE_PERCTRL_ACMP0INV_MASK          0x1000000UL                             /**< Bit mask for LESENSE_ACMP0INV               */
#define _LESENSE_PERCTRL_ACMP0INV_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define LESENSE_PERCTRL_ACMP0INV_DEFAULT        (_LESENSE_PERCTRL_ACMP0INV_DEFAULT << 24) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */
#define LESENSE_PERCTRL_ACMP1INV                (0x1UL << 25)                           /**< Invert analog comparator 1 output           */
#define _LESENSE_PERCTRL_ACMP1INV_SHIFT         25                                      /**< Shift value for LESENSE_ACMP1INV            */
#define _LESENSE_PERCTRL_ACMP1INV_MASK          0x2000000UL                             /**< Bit mask for LESENSE_ACMP1INV               */
#define _LESENSE_PERCTRL_ACMP1INV_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_PERCTRL            */
#define LESENSE_PERCTRL_ACMP1INV_DEFAULT        (_LESENSE_PERCTRL_ACMP1INV_DEFAULT << 25) /**< Shifted mode DEFAULT for LESENSE_PERCTRL    */

/* Bit fields for LESENSE DECCTRL */
#define _LESENSE_DECCTRL_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_DECCTRL           */
#define _LESENSE_DECCTRL_MASK                   0x000000FDUL                            /**< Mask for LESENSE_DECCTRL                    */
#define LESENSE_DECCTRL_DECDIS                  (0x1UL << 0)                            /**< Disable the decoder                         */
#define _LESENSE_DECCTRL_DECDIS_SHIFT           0                                       /**< Shift value for LESENSE_DECDIS              */
#define _LESENSE_DECCTRL_DECDIS_MASK            0x1UL                                   /**< Bit mask for LESENSE_DECDIS                 */
#define _LESENSE_DECCTRL_DECDIS_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_DECDIS_DEFAULT          (_LESENSE_DECCTRL_DECDIS_DEFAULT << 0)  /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_INTMAP                  (0x1UL << 2)                            /**< Enable decoder to channel interrupt map     */
#define _LESENSE_DECCTRL_INTMAP_SHIFT           2                                       /**< Shift value for LESENSE_INTMAP              */
#define _LESENSE_DECCTRL_INTMAP_MASK            0x4UL                                   /**< Bit mask for LESENSE_INTMAP                 */
#define _LESENSE_DECCTRL_INTMAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_INTMAP_DEFAULT          (_LESENSE_DECCTRL_INTMAP_DEFAULT << 2)  /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_HYSTPRS0                (0x1UL << 3)                            /**< Enable decoder hysteresis on PRS0 output    */
#define _LESENSE_DECCTRL_HYSTPRS0_SHIFT         3                                       /**< Shift value for LESENSE_HYSTPRS0            */
#define _LESENSE_DECCTRL_HYSTPRS0_MASK          0x8UL                                   /**< Bit mask for LESENSE_HYSTPRS0               */
#define _LESENSE_DECCTRL_HYSTPRS0_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_HYSTPRS0_DEFAULT        (_LESENSE_DECCTRL_HYSTPRS0_DEFAULT << 3) /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_HYSTPRS1                (0x1UL << 4)                            /**< Enable decoder hysteresis on PRS1 output    */
#define _LESENSE_DECCTRL_HYSTPRS1_SHIFT         4                                       /**< Shift value for LESENSE_HYSTPRS1            */
#define _LESENSE_DECCTRL_HYSTPRS1_MASK          0x10UL                                  /**< Bit mask for LESENSE_HYSTPRS1               */
#define _LESENSE_DECCTRL_HYSTPRS1_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_HYSTPRS1_DEFAULT        (_LESENSE_DECCTRL_HYSTPRS1_DEFAULT << 4) /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_HYSTPRS2                (0x1UL << 5)                            /**< Enable decoder hysteresis on PRS2 output    */
#define _LESENSE_DECCTRL_HYSTPRS2_SHIFT         5                                       /**< Shift value for LESENSE_HYSTPRS2            */
#define _LESENSE_DECCTRL_HYSTPRS2_MASK          0x20UL                                  /**< Bit mask for LESENSE_HYSTPRS2               */
#define _LESENSE_DECCTRL_HYSTPRS2_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_HYSTPRS2_DEFAULT        (_LESENSE_DECCTRL_HYSTPRS2_DEFAULT << 5) /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_HYSTIRQ                 (0x1UL << 6)                            /**< Enable decoder hysteresis on interrupt r    */
#define _LESENSE_DECCTRL_HYSTIRQ_SHIFT          6                                       /**< Shift value for LESENSE_HYSTIRQ             */
#define _LESENSE_DECCTRL_HYSTIRQ_MASK           0x40UL                                  /**< Bit mask for LESENSE_HYSTIRQ                */
#define _LESENSE_DECCTRL_HYSTIRQ_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_HYSTIRQ_DEFAULT         (_LESENSE_DECCTRL_HYSTIRQ_DEFAULT << 6) /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */
#define LESENSE_DECCTRL_PRSCNT                  (0x1UL << 7)                            /**< Enable count mode on decoder PRS channel    */
#define _LESENSE_DECCTRL_PRSCNT_SHIFT           7                                       /**< Shift value for LESENSE_PRSCNT              */
#define _LESENSE_DECCTRL_PRSCNT_MASK            0x80UL                                  /**< Bit mask for LESENSE_PRSCNT                 */
#define _LESENSE_DECCTRL_PRSCNT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECCTRL            */
#define LESENSE_DECCTRL_PRSCNT_DEFAULT          (_LESENSE_DECCTRL_PRSCNT_DEFAULT << 7)  /**< Shifted mode DEFAULT for LESENSE_DECCTRL    */

