SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_lesense.h
/* Bit fields for LESENSE CH_INTERACT */
#define _LESENSE_CH_INTERACT_RESETVALUE         0x00000000UL                            /**< Default value for LESENSE_CH_INTERACT       */
#define _LESENSE_CH_INTERACT_MASK               0x3FFF0FFFUL                            /**< Mask for LESENSE_CH_INTERACT                */
#define _LESENSE_CH_INTERACT_THRES_SHIFT        0                                       /**< Shift value for LESENSE_THRES               */
#define _LESENSE_CH_INTERACT_THRES_MASK         0xFFFUL                                 /**< Bit mask for LESENSE_THRES                  */
#define _LESENSE_CH_INTERACT_THRES_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define LESENSE_CH_INTERACT_THRES_DEFAULT       (_LESENSE_CH_INTERACT_THRES_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define _LESENSE_CH_INTERACT_EXMODE_SHIFT       16                                      /**< Shift value for LESENSE_EXMODE              */
#define _LESENSE_CH_INTERACT_EXMODE_MASK        0x30000UL                               /**< Bit mask for LESENSE_EXMODE                 */
#define _LESENSE_CH_INTERACT_EXMODE_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_EXMODE_DISABLE     0x00000000UL                            /**< Mode DISABLE for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_EXMODE_HIGH        0x00000001UL                            /**< Mode HIGH for LESENSE_CH_INTERACT           */
#define _LESENSE_CH_INTERACT_EXMODE_LOW         0x00000002UL                            /**< Mode LOW for LESENSE_CH_INTERACT            */
#define _LESENSE_CH_INTERACT_EXMODE_DACOUT      0x00000003UL                            /**< Mode DACOUT for LESENSE_CH_INTERACT         */
#define LESENSE_CH_INTERACT_EXMODE_DEFAULT      (_LESENSE_CH_INTERACT_EXMODE_DEFAULT << 16) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_EXMODE_DISABLE      (_LESENSE_CH_INTERACT_EXMODE_DISABLE << 16) /**< Shifted mode DISABLE for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_EXMODE_HIGH         (_LESENSE_CH_INTERACT_EXMODE_HIGH << 16) /**< Shifted mode HIGH for LESENSE_CH_INTERACT   */
#define LESENSE_CH_INTERACT_EXMODE_LOW          (_LESENSE_CH_INTERACT_EXMODE_LOW << 16) /**< Shifted mode LOW for LESENSE_CH_INTERACT    */
#define LESENSE_CH_INTERACT_EXMODE_DACOUT       (_LESENSE_CH_INTERACT_EXMODE_DACOUT << 16) /**< Shifted mode DACOUT for LESENSE_CH_INTERACT */
#define LESENSE_CH_INTERACT_ALTEX               (0x1UL << 18)                           /**< Use alternative excite pin                  */
#define _LESENSE_CH_INTERACT_ALTEX_SHIFT        18                                      /**< Shift value for LESENSE_ALTEX               */
#define _LESENSE_CH_INTERACT_ALTEX_MASK         0x40000UL                               /**< Bit mask for LESENSE_ALTEX                  */
#define _LESENSE_CH_INTERACT_ALTEX_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define LESENSE_CH_INTERACT_ALTEX_DEFAULT       (_LESENSE_CH_INTERACT_ALTEX_DEFAULT << 18) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SAMPLECLK           (0x1UL << 19)                           /**< Select clock used for timing of sample d    */
#define _LESENSE_CH_INTERACT_SAMPLECLK_SHIFT    19                                      /**< Shift value for LESENSE_SAMPLECLK           */
#define _LESENSE_CH_INTERACT_SAMPLECLK_MASK     0x80000UL                               /**< Bit mask for LESENSE_SAMPLECLK              */
#define _LESENSE_CH_INTERACT_SAMPLECLK_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_SAMPLECLK_LFACLK   0x00000000UL                            /**< Mode LFACLK for LESENSE_CH_INTERACT         */
#define _LESENSE_CH_INTERACT_SAMPLECLK_AUXHFRCO 0x00000001UL                            /**< Mode AUXHFRCO for LESENSE_CH_INTERACT       */
#define LESENSE_CH_INTERACT_SAMPLECLK_DEFAULT   (_LESENSE_CH_INTERACT_SAMPLECLK_DEFAULT << 19) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SAMPLECLK_LFACLK    (_LESENSE_CH_INTERACT_SAMPLECLK_LFACLK << 19) /**< Shifted mode LFACLK for LESENSE_CH_INTERACT */
#define LESENSE_CH_INTERACT_SAMPLECLK_AUXHFRCO  (_LESENSE_CH_INTERACT_SAMPLECLK_AUXHFRCO << 19) /**< Shifted mode AUXHFRCO for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_EXCLK               (0x1UL << 20)                           /**< Select clock used for excitation timing     */
#define _LESENSE_CH_INTERACT_EXCLK_SHIFT        20                                      /**< Shift value for LESENSE_EXCLK               */
#define _LESENSE_CH_INTERACT_EXCLK_MASK         0x100000UL                              /**< Bit mask for LESENSE_EXCLK                  */
#define _LESENSE_CH_INTERACT_EXCLK_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_EXCLK_LFACLK       0x00000000UL                            /**< Mode LFACLK for LESENSE_CH_INTERACT         */
#define _LESENSE_CH_INTERACT_EXCLK_AUXHFRCO     0x00000001UL                            /**< Mode AUXHFRCO for LESENSE_CH_INTERACT       */
#define LESENSE_CH_INTERACT_EXCLK_DEFAULT       (_LESENSE_CH_INTERACT_EXCLK_DEFAULT << 20) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_EXCLK_LFACLK        (_LESENSE_CH_INTERACT_EXCLK_LFACLK << 20) /**< Shifted mode LFACLK for LESENSE_CH_INTERACT */
#define LESENSE_CH_INTERACT_EXCLK_AUXHFRCO      (_LESENSE_CH_INTERACT_EXCLK_AUXHFRCO << 20) /**< Shifted mode AUXHFRCO for LESENSE_CH_INTERACT*/
#define _LESENSE_CH_INTERACT_SETIF_SHIFT        21                                      /**< Shift value for LESENSE_SETIF               */
#define _LESENSE_CH_INTERACT_SETIF_MASK         0xE00000UL                              /**< Bit mask for LESENSE_SETIF                  */
#define _LESENSE_CH_INTERACT_SETIF_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_SETIF_NONE         0x00000000UL                            /**< Mode NONE for LESENSE_CH_INTERACT           */
#define _LESENSE_CH_INTERACT_SETIF_LEVEL        0x00000001UL                            /**< Mode LEVEL for LESENSE_CH_INTERACT          */
#define _LESENSE_CH_INTERACT_SETIF_POSEDGE      0x00000002UL                            /**< Mode POSEDGE for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_SETIF_NEGEDGE      0x00000003UL                            /**< Mode NEGEDGE for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_SETIF_BOTHEDGES    0x00000004UL                            /**< Mode BOTHEDGES for LESENSE_CH_INTERACT      */
#define LESENSE_CH_INTERACT_SETIF_DEFAULT       (_LESENSE_CH_INTERACT_SETIF_DEFAULT << 21) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SETIF_NONE          (_LESENSE_CH_INTERACT_SETIF_NONE << 21) /**< Shifted mode NONE for LESENSE_CH_INTERACT   */
#define LESENSE_CH_INTERACT_SETIF_LEVEL         (_LESENSE_CH_INTERACT_SETIF_LEVEL << 21) /**< Shifted mode LEVEL for LESENSE_CH_INTERACT  */
#define LESENSE_CH_INTERACT_SETIF_POSEDGE       (_LESENSE_CH_INTERACT_SETIF_POSEDGE << 21) /**< Shifted mode POSEDGE for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SETIF_NEGEDGE       (_LESENSE_CH_INTERACT_SETIF_NEGEDGE << 21) /**< Shifted mode NEGEDGE for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SETIF_BOTHEDGES     (_LESENSE_CH_INTERACT_SETIF_BOTHEDGES << 21) /**< Shifted mode BOTHEDGES for LESENSE_CH_INTERACT*/
#define _LESENSE_CH_INTERACT_OFFSET_SHIFT       24                                      /**< Shift value for LESENSE_OFFSET              */
#define _LESENSE_CH_INTERACT_OFFSET_MASK        0xF000000UL                             /**< Bit mask for LESENSE_OFFSET                 */
#define _LESENSE_CH_INTERACT_OFFSET_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define LESENSE_CH_INTERACT_OFFSET_DEFAULT      (_LESENSE_CH_INTERACT_OFFSET_DEFAULT << 24) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define _LESENSE_CH_INTERACT_SAMPLE_SHIFT       28                                      /**< Shift value for LESENSE_SAMPLE              */
#define _LESENSE_CH_INTERACT_SAMPLE_MASK        0x30000000UL                            /**< Bit mask for LESENSE_SAMPLE                 */
#define _LESENSE_CH_INTERACT_SAMPLE_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_CH_INTERACT        */
#define _LESENSE_CH_INTERACT_SAMPLE_ACMPCOUNT   0x00000000UL                            /**< Mode ACMPCOUNT for LESENSE_CH_INTERACT      */
#define _LESENSE_CH_INTERACT_SAMPLE_ACMP        0x00000001UL                            /**< Mode ACMP for LESENSE_CH_INTERACT           */
#define _LESENSE_CH_INTERACT_SAMPLE_ADC         0x00000002UL                            /**< Mode ADC for LESENSE_CH_INTERACT            */
#define _LESENSE_CH_INTERACT_SAMPLE_ADCDIFF     0x00000003UL                            /**< Mode ADCDIFF for LESENSE_CH_INTERACT        */
#define LESENSE_CH_INTERACT_SAMPLE_DEFAULT      (_LESENSE_CH_INTERACT_SAMPLE_DEFAULT << 28) /**< Shifted mode DEFAULT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SAMPLE_ACMPCOUNT    (_LESENSE_CH_INTERACT_SAMPLE_ACMPCOUNT << 28) /**< Shifted mode ACMPCOUNT for LESENSE_CH_INTERACT*/
#define LESENSE_CH_INTERACT_SAMPLE_ACMP         (_LESENSE_CH_INTERACT_SAMPLE_ACMP << 28) /**< Shifted mode ACMP for LESENSE_CH_INTERACT   */
#define LESENSE_CH_INTERACT_SAMPLE_ADC          (_LESENSE_CH_INTERACT_SAMPLE_ADC << 28) /**< Shifted mode ADC for LESENSE_CH_INTERACT    */
#define LESENSE_CH_INTERACT_SAMPLE_ADCDIFF      (_LESENSE_CH_INTERACT_SAMPLE_ADCDIFF << 28) /**< Shifted mode ADCDIFF for LESENSE_CH_INTERACT*/

